# def cars(a, b, c):
#     a = a // 4
#     c = c // 2
#     d = min(a, b, c)
#     return d
#
#
# print(f'У вас получится {cars(2, 48, 76)} машин!')
# print(f'У вас получится {cars(43, 15, 87)} машин!')
# print(f'У вас получится {cars(88, 37, 17)} машин!')

# def median(n):
#     n.sort()
#     if len(n) % 2 == 0:
#         return (n[len(n) // 2] + n[len(n) // 2 - 1]) / 2
#     else:
#         return n[len(n) // 2]
#
#
# print(f'Медианой Вашего списка будет {median([1, 2, 4, 5, 6, 8, 8, 8, 10])}')
# print(f'Медианой Вашего списка будет {median([2, 2, 6, 8, 8, 10, 10])}')
# print(f'Медианой Вашего списка будет {median([1, 2, 2, 4, 7, 8, 9, 10])}')
